Tekla Open API Reference for Tekla Structures 2025
AABB Constructor (IEnumerable<Point>)
 Constructs AABB from given point list.
 Namespace: Tekla.Structures.Geometry3d
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public AABB(
	IEnumerable<Point> Points
)
Public Sub New (
	Points As IEnumerable(Of Point)
)
Parameters
Points
Type: System.Collections.Generic.IEnumerable<Point>
[Missing <param name="Points"/> documentation for "M:Tekla.Structures.Geometry3d.AABB.#ctor(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point})"]
See Also
Reference
AABB Class
AABB Overload
Tekla.Structures.Geometry3d Namespace